dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/GPIOA_1.0.xml
    <register id="GPIOA_DMAMASK" width="32" offset="0x1510" description="DMA Write MASK">
        <bitfield id="DOUT0" description="DMA is allowed to modify DOUT0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT1" description="DMA is allowed to modify DOUT1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT2" description="DMA is allowed to modify DOUT2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT3" description="DMA is allowed to modify DOUT3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT4" description="DMA is allowed to modify DOUT4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT5" description="DMA is allowed to modify DOUT5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT6" description="DMA is allowed to modify DOUT6" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT7" description="DMA is allowed to modify DOUT7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT8" description="DMA is allowed to modify DOUT8" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT9" description="DMA is allowed to modify DOUT9" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT10" description="DMA is allowed to modify DOUT10" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT11" description="DMA is allowed to modify DOUT11" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT12" description="DMA is allowed to modify DOUT12" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT13" description="DMA is allowed to modify DOUT13" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT14" description="DMA is allowed to modify DOUT14" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT15" description="DMA is allowed to modify DOUT15" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT16" description="DMA is allowed to modify DOUT16" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT17" description="DMA is allowed to modify DOUT17" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT18" description="DMA is allowed to modify DOUT18" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT19" description="DMA is allowed to modify DOUT19" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT20" description="DMA is allowed to modify DOUT20" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT21" description="DMA is allowed to modify DOUT21" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT22" description="DMA is allowed to modify DOUT22" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT23" description="DMA is allowed to modify DOUT23" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT24" description="DMA is allowed to modify DOUT24" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT25" description="DMA is allowed to modify DOUT25" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT26" description="DMA is allowed to modify DOUT26" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT27" description="DMA is allowed to modify DOUT27" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT28" description="DMA is allowed to modify DOUT28" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT29" description="DMA is allowed to modify DOUT29" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT30" description="DMA is allowed to modify DOUT30" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
        <bitfield id="DOUT31" description="DMA is allowed to modify DOUT31" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA is not allowed to modify this bit lane"/>
            <bitenum id="ENABLE" value="0x1" description="DMA is allowed to modify this bit lane"/>
        </bitfield>
    </register>
    <register id="GPIOA_SUB1CFG" width="32" offset="0x1520" description="Subscriber 1 configuration">
        <bitfield id="ENABLE" description="This bit is used to enable subscriber 1 event." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Subscriber 1 event is disabled"/>
            <bitenum id="SET" value="0x1" description="Subscriber 1 event is enabled"/>
        </bitfield>
        <bitfield id="OUTPOLICY" description="These bits configure the output policy for subscriber 1 event." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="SET" value="0x0" description="Selected DIO pins are set"/>
            <bitenum id="CLR" value="0x1" description="Selected DIO pins are cleared"/>
            <bitenum id="TOGGLE" value="0x2" description="Selected DIO pins are toggled"/>
        </bitfield>
        <bitfield id="INDEX" description="indicates the specific bit in the upper 16 bits that is targeted by the subscriber action" begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="specific bit targeted by the subscriber action is bit16"/>
            <bitenum id="MAX" value="0xF" description="specific bit targeted by the subscriber action is bit31"/>
        </bitfield>
    </register>

</module>